// let numbers = [10, 20, 30, 40, 50];
// console.log(numbers);

/*----------------------------------------------------------
🔴 মূল বিষয়: Array.push() কি return করে?

push() array এর নতুন length (দৈর্ঘ্য) return করে।
পুশ করা value না।

MDN definition অনুযায়ী:

The push() method returns the new length of the array.
----------------------------------------------------------*/

// ------------------------------------------------------
//                          use [.push()]
// -----------------------------------------------------
// numbers.push(500);
// numbers.unshift(200);
// console.log(numbers);

// ------------------------------------------------------
//                          use [.pop()]
// -----------------------------------------------------
// numbers.pop();
// numbers.shift();
// console.log(numbers);
